## 4.9 Intro to Data Visualization

### This script contains the following points:

#### 1. Create data to experiment on
#### 2. Clean data
#### 3. Check and export data

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#import customer.csv
path = r'/Users/rachelallen/CareerFoundry Achievement 4/08-2022 Instacart Basket Analysis'

In [3]:
customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
#examine data
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
customer.shape

(206209, 10)

In [8]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

that max income looks a little weird

In [10]:
#check for blanks
customer['user_id'].value_counts(dropna = False)

26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: user_id, Length: 206209, dtype: int64

In [12]:
customer['First Name'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: First Name, Length: 208, dtype: int64

#lots of NaN in first name

In [13]:
customer['Surnam'].value_counts(dropna = False)

Hamilton      252
Randall       248
Lamb          243
Pennington    243
Barnett       242
             ...
Poole         172
Bauer         166
Pearson       164
Payne         163
Jordan        162
Name: Surnam, Length: 1000, dtype: int64

In [14]:
customer['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [15]:
customer['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [16]:
customer['STATE'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: STATE, dtype: int64

In [17]:
customer['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [18]:
customer['date_joined'].value_counts(dropna = False)

9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [19]:
customer['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [20]:
customer['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [21]:
customer['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [24]:
customer.isnull().sum()

user_id             0
First Name      11259
Surnam              0
Gender              0
STATE               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

In [23]:
#check for duplicates
customer.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [25]:
customer_dups = customer[customer.duplicated()]

In [34]:
#flag NaN first names

customer['no_first_name'] = np.where(customer['First Name'].notna(), 'No Missing Name', 'Missing Name')

In [35]:
customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income,no_first_name
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,No Missing Name
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,No Missing Name
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568,No Missing Name
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049,No Missing Name
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374,No Missing Name

In [38]:
#did it flag the correct number of values: yes
customer['no_first_name'].value_counts()

No Missing Name    194950
Missing Name        11259
Name: no_first_name, dtype: int64

In [39]:
#rename columns  Surnam --> Last Name
customer.rename(columns = {'Surnam': 'Last Name'}, inplace = True)

In [40]:
customer.rename(columns = {'STATE': 'State'}, inplace = True)

In [41]:
customer.head()

,user_id,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income,no_first_name
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,No Missing Name
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285,No Missing Name
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568,No Missing Name
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049,No Missing Name
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374,No Missing Name

In [43]:
#still wondering about that max income 
customer['income'].max()

593901

Maybe that's reasonable, I would need to ask a client about it

In [44]:
# I don't know what kind of analysis the company wants to do so I am hesitant to drop any of the columns

In [45]:
##check for mixed types
for col in customer.columns.tolist():
  weird = (customer[[col]].applymap(type) != customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customer[weird]) > 0:
    print (col)

First Name

In [46]:
#First Name is a mixed type columnn, let's change it all to string
customer['First Name'] = customer['First Name'].astype('str')

In [47]:
#check type of key column user_id
customer['user_id'].dtype

dtype('int64')

In [49]:
#import the merged dataframe
ords_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_updated_2.pkl'))

In [50]:
ords_prods_merged.head()

,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order,flagged,product_id,add_to_cart_order,reordered,...,busiest_day,busiest_days,busiest_period_of_day,mean_order,max_order,loyalty_flag,mean_spending,spending_flag,median_days_since_prior,frequency_flag
0,2539329.0,1.0,1.0,2.0,8.0,NaN,No Previous Order,196,1.0,0.0,...,Regularly busy,Regularly busy,Average orders,17.225802,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795.0,1.0,2.0,3.0,7.0,15.0,Previous Order,196,1.0,1.0,...,Regularly busy,Least busy days,Average orders,17.225802,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747.0,1.0,3.0,3.0,12.0,21.0,Previous Order,196,1.0,1.0,...,Regularly busy,Least busy days,Average orders,17.225802,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736.0,1.0,4.0,4.0,7.0,29.0,Previous Order,196,1.0,1.0,...,Least busy,Least busy days,Average orders,17.225802,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534.0,1.0,5.0,4.0,15.0,28.0,Previous Order,196,1.0,1.0,...,Least busy,Least busy days,Average orders,17.225802,10.0,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [52]:
ords_prods_merged['user_id'].dtype

dtype('float64')

In [53]:
#convert customer['user_id'] to float
customer['user_id'] = customer['user_id'].astype(float)

In [54]:
#check type of key column user_id
customer['user_id'].dtype

dtype('float64')

In [58]:
#consistency check after cleaning
customer.shape

(206209, 11)

In [65]:
#combine data frames as 'orders_products_all'
orders_products_all = ords_prods_merged.merge(customer, on = 'user_id', how = 'outer')

In [66]:
#check the data
orders_products_all.head()

,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order,flagged,product_id,add_to_cart_order,reordered,...,First Name,Last Name,Gender,State,Age,date_joined,n_dependants,fam_status,income,no_first_name
0,2539329.0,1.0,1.0,2.0,8.0,NaN,No Previous Order,196,1.0,0.0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,No Missing Name
1,2398795.0,1.0,2.0,3.0,7.0,15.0,Previous Order,196,1.0,1.0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,No Missing Name
2,473747.0,1.0,3.0,3.0,12.0,21.0,Previous Order,196,1.0,1.0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,No Missing Name
3,2254736.0,1.0,4.0,4.0,7.0,29.0,Previous Order,196,1.0,1.0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,No Missing Name
4,431534.0,1.0,5.0,4.0,15.0,28.0,Previous Order,196,1.0,1.0,...,Linda,Nguyen,Female,Alabama,31.0,2/17/2019,3.0,married,40423.0,No Missing Name

In [67]:
orders_products_all.shape

(32435070, 37)

In [68]:
orders_products_all.describe()

,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order,product_id,add_to_cart_order,reordered,aisle_id,department_id,prices,mean_order,max_order,mean_spending,median_days_since_prior,Age,n_dependants,income
count,3.243506e+07,3.243506e+07,3.243506e+07,3.243506e+07,3.243506e+07,3.035696e+07,3.243507e+07,3.243506e+07,3.243506e+07,3.240487e+07,3.240487e+07,3.240487e+07,3.240487e+07,3.243506e+07,3.243506e+07,3.243506e+07,3.243506e+07,3.243506e+07,3.243506e+07
mean,1.710748e+06,1.029372e+05,1.714195e+01,2.738815e+00,1.342498e+01,1.110414e+01,2.557635e+04,8.351081e+00,5.896955e-01,7.119612e+01,9.919794e+00,1.198022e+01,1.714231e+01,3.305231e+01,1.197850e+01,1.039779e+01,4.946512e+01,1.501877e+00,9.943550e+04
std,9.873006e+05,5.946651e+04,1.753496e+01,2.090051e+00,4.246357e+00,8.778941e+00,1.409657e+04,7.126656e+00,4.918889e-01,3.821138e+01,6.281486e+00,4.956554e+02,8.663542e-01,2.515463e+01,8.321715e+01,7.131238e+00,1.848555e+01,1.118869e+00,4.305540e+04
min,2.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.521575e+01,3.000000e+00,1.000000e+00,0.000000e+00,1.800000e+01,0.000000e+00,2.590300e+04
25%,8.559430e+05,5.142000e+04,5.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,1.353200e+04,3.000000e+00,0.000000e+00,3.100000e+01,4.000000e+00,4.200000e+00,1.658354e+01,1.300000e+01,7.387179e+00,6.000000e+00,3.300000e+01,1.000000e+00,6.700200e+04
50%,1.711047e+06,1.026110e+05,1.100000e+01,3.000000e+00,1.300000e+01,8.000000e+00,2.525600e+04,6.000000e+00,1.000000e+00,8.300000e+01,9.000000e+00,7.400000e+00,1.722580e+01,2.600000e+01,7.824742e+00,8.000000e+00,4.900000e+01,2.000000e+00,9.661200e+04
75%,2.565514e+06,1.543910e+05,2.400000e+01,5.000000e+00,1.600000e+01,1.500000e+01,3.793500e+04,1.100000e+01,1.000000e+00,1.070000e+02,1.600000e+01,1.130000e+01,1.781140e+01,4.700000e+01,8.253968e+00,1.300000e+01,6.500000e+01,3.000000e+00,1.279080e+05
max,3.421083e+06,2.062090e+05,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,4.968800e+04,1.450000e+02,1.000000e+00,1.340000e+02,2.100000e+01,9.999900e+04,2.290238e+01,9.900000e+01,2.500542e+04,3.000000e+01,8.100000e+01,3.000000e+00,5.939010e+05

In [69]:
#export as pickle
orders_products_all.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))